<!DOCTYPE html>
<html lang="en">
<head>
	<meta charset="UTF-8">
	<title>ДЗ №2 'Switch case'</title>
</head>
<body>
<?php 
ini_set('default_charset','utf-8');

/*Конструкция switch-case

22. Создайте конструкцию с помощью switch/case состоящую из проверок названий месяцев. Каждый case - это месяц года, при выполнении которого должно отобразится название месяца. Создайте переменную, значение которой будет названием одного из месяцев. Передайте эту переменную в конструкцию switch/case и убедитесь, что выполнилась правильная проверка.*/
/*$month = 'Январь';
	switch ($month) {
		case 'Январь':
			echo "Это 1й месяц";
			break;
		case 'Февраль':
			echo "Это 2й месяц";
			break;
		case 'Март':
			echo "Это 3й месяц";
			break;	
		case 'Апрель':
			echo "Это 4й месяц";
			break;	
		case 'Май':
			echo "Это 5й месяц";
			break;
		case 'Июнь':
			echo "Это 6й месяц";
			break;
		case 'Июль':
			echo "Это 7й месяц";
			break;	
		case 'Агуст':
			echo "Это 8й месяц";
			break;	
		case 'Сентябрь':
			echo "Это 9й месяц";
			break;
		case 'Октябрь':
			echo "Это 10й месяц";
			break;
		case 'Ноябрь':
			echo "Это 11й месяц";
			break;	
		case 'Декабрь':
			echo "Это 12й месяц";
			break;		
	}*/

/*23. В переменной $day лежит число от 1 до 31. Определите в какую декаду месяца попадает это число (в первую, вторую или третью).*/
/*$a=22;
switch ($a) {
		case ($a>0 && $a<11):
			echo "1я декада";
			break;
		case ($a>10 && $a<21):
			echo "2я декада";
			break;
		default:
			echo "3я декада";
			break;		
}*/	

/*24. В переменной $month лежит число от 1 до 12. Определите в какую пору года попадает этот месяц (зима, лето, весна, осень).*/	
/*$a=4;
switch ($a) {
		case ($a>0 && $a<4):
			echo "1й сезон";
			break;
		case ($a>3 && $a<7):
			echo "2й сезон";
			break;
		case ($a>6 && $a<10):
			echo "3й сезон";
			break;	
		default:
			echo "4й сезон";
			break;		
}*/	

?>	
</body>
</html>
